{"config": [{"config": {"function_type": "lambda", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa-/home/kbaafi/SDCAR/BehavioralCloning/model.py\u00da\b<lambda>\u001d\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "arguments": {}, "name": "lambda_1", "output_shape": null, "input_dtype": "float32", "batch_input_shape": [null, 64, 64, 3]}, "class_name": "Lambda"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "b_regularizer": null, "bias": true, "nb_filter": 24, "subsample": [2, 2], "init": "he_normal", "activation": "linear", "activity_regularizer": null, "nb_row": 5, "W_constraint": null, "name": "convolution2d_1", "nb_col": 5, "W_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "b_regularizer": null, "bias": true, "nb_filter": 36, "subsample": [2, 2], "init": "he_normal", "activation": "linear", "activity_regularizer": null, "nb_row": 5, "W_constraint": null, "name": "convolution2d_2", "nb_col": 5, "W_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "b_regularizer": null, "bias": true, "nb_filter": 48, "subsample": [2, 2], "init": "he_normal", "activation": "linear", "activity_regularizer": null, "nb_row": 5, "W_constraint": null, "name": "convolution2d_3", "nb_col": 5, "W_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "b_regularizer": null, "bias": true, "nb_filter": 64, "subsample": [1, 1], "init": "he_normal", "activation": "linear", "activity_regularizer": null, "nb_row": 3, "W_constraint": null, "name": "convolution2d_4", "nb_col": 3, "W_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "b_regularizer": null, "bias": true, "nb_filter": 64, "subsample": [1, 1], "init": "he_normal", "activation": "linear", "activity_regularizer": null, "nb_row": 3, "W_constraint": null, "name": "convolution2d_5", "nb_col": 3, "W_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "input_dim": 64, "trainable": true, "b_regularizer": null, "bias": true, "init": "he_normal", "output_dim": 1164, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "name": "dense_1", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "input_dim": 1164, "trainable": true, "b_regularizer": null, "bias": true, "init": "he_normal", "output_dim": 100, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "name": "dense_2", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_7", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "input_dim": 100, "trainable": true, "b_regularizer": null, "bias": true, "init": "he_normal", "output_dim": 50, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "name": "dense_3", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_8", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "input_dim": 50, "trainable": true, "b_regularizer": null, "bias": true, "init": "he_normal", "output_dim": 10, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "name": "dense_4", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_9", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "input_dim": 10, "trainable": true, "b_regularizer": null, "bias": true, "init": "he_normal", "output_dim": 1, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "name": "dense_5", "W_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}